In [25]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [26]:
df.drop(['PassengerId','Name','SibSp','Cabin','Embarked','Ticket'], axis = 'columns', inplace = True)
df.head()

   Pclass     Sex   Age  Parch     Fare  Survived
0       3    male  22.0      0   7.2500         0
1       1  female  38.0      0  71.2833         1
2       3  female  26.0      0   7.9250         1
3       1  female  35.0      0  53.1000         1
4       3    male  35.0      0   8.0500         0

In [27]:
target = df.Survived
inputs = df.drop('Survived', axis = 'columns')

In [28]:
dumies = pd.get_dummies(inputs.Sex)
dumies.head(4)

   female  male
0       0     1
1       1     0
2       1     0
3       1     0

In [31]:
inputs = pd.concat([inputs,dumies], axis = 'columns')
inputs.head()

   Pclass     Sex   Age  Parch     Fare  female  male
0       3    male  22.0      0   7.2500       0     1
1       1  female  38.0      0  71.2833       1     0
2       3  female  26.0      0   7.9250       1     0
3       1  female  35.0      0  53.1000       1     0
4       3    male  35.0      0   8.0500       0     1

In [32]:
inputs = df.drop('Sex',axis = 'columns')

In [33]:
inputs.head(2)

   Pclass   Age  Parch     Fare  Survived
0       3  22.0      0   7.2500         0
1       1  38.0      0  71.2833         1

In [61]:
# for checking null value
input.isna().any()

Pclass    False
Sex       False
Age        True
Parch     False
Ticket    False
Fare      False
dtype: bool

In [62]:
# Now we are filling NaN values with mean of Age column
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

In [63]:
inputs.head(6)

   Pclass        Age  Parch     Fare  Survived
0       3  22.000000      0   7.2500         0
1       1  38.000000      0  71.2833         1
2       3  26.000000      0   7.9250         1
3       1  35.000000      0  53.1000         1
4       3  35.000000      0   8.0500         0
5       3  29.699118      0   8.4583         0

In [64]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size = 0.2)

In [65]:
len(X_train)

712

In [66]:
len(X_test)

179

In [67]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()
model.fit(X_train,y_train)

GaussianNB()

In [68]:
model.score(X_test,y_test)

1.0

In [69]:
X_test[:10]

     Pclass   Age  Parch     Fare  Survived
317       2  54.0      0  14.0000         0
423       3  28.0      1  14.4000         0
504       1  16.0      0  86.5000         1
479       3   2.0      1  12.2875         1
386       3   1.0      2  46.9000         0
883       2  28.0      0  10.5000         0
836       3  21.0      0   8.6625         0
381       3   1.0      2  15.7417         1
139       1  24.0      0  79.2000         0
73        3  26.0      0  14.4542         0

In [70]:
y_test[:10]

317    0
423    0
504    1
479    1
386    0
883    0
836    0
381    1
139    0
73     0
Name: Survived, dtype: int64

In [72]:
model.predict(X_test[:10])

array([0, 0, 1, 1, 0, 0, 0, 1, 0, 0], dtype=int64)

In [ ]:
# Now we can check the probability of survi

In [74]:
model.predict_proba(X_test[:10])

array([[1., 0.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [1., 0.],
       [1., 0.]])